Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplittingCurvesWithMultipleNeighbors Property
 A point cannot coincide with end points of more than two curve elements. All curve elements adjacent to such a point are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceSplittingCurvesWithMultipleNeighbors { get; }
Public Shared ReadOnly Property DividedSurfaceSplittingCurvesWithMultipleNeighbors As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceSplittingCurvesWithMultipleNeighbors {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceSplittingCurvesWithMultipleNeighbors : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace